# Install directory
cask_args appdir: '/Applications'

# CLIs
brew 'docker'
brew 'dotnet'
brew 'git'
brew 'gemini-cli'
brew 'gh'
brew 'lazydocker'
brew 'lazygit'
brew 'mongodb-atlas-cli'
brew 'node'
brew 'ollama'
brew 'poetry'
brew 'pyenv'
brew 'ta-lib'
brew 'zsh-syntax-highlighting'

# GUIs
cask '1password'
cask 'alt-tab'
cask 'appcleaner'
cask 'basecamp'
cask 'beyond-compare@4'
cask 'cursor'
cask 'docker-desktop'
cask 'elgato-control-center'
cask 'font-fira-code'
cask 'google-chrome'
cask 'google-drive'
cask 'grammarly-desktop'
cask 'hey-desktop'
cask 'iterm2'
cask 'minecraft'
cask 'mongodb-compass'
cask 'ngrok'
cask 'pycharm'
cask 'rectangle'
cask 'rider'
cask 'smoothscroll'
cask 'spotify'
cask 'stats'
cask 'vlc'
cask 'visual-studio-code'
cask 'whatsapp'
#cask 'zed'
