# Install directory
cask_args appdir: '/Applications'

# CLIs
brew 'azure-cli'
brew 'git'
brew 'gh'
brew 'go-task'
brew 'hugo'
brew 'lazydocker'
brew 'lazygit'
#brew 'mongodb-atlas-cli'
brew 'node'
#brew 'poetry'
#brew 'pyenv'
#brew 'ta-lib'
brew 'zsh-syntax-highlighting'

# GUIs
cask '1password'
cask 'alt-tab'
cask 'appcleaner'
cask 'bambu-studio'
cask 'basecamp'
cask 'beyond-compare'
cask 'cursor'
cask 'docker-desktop'
cask 'dotnet-sdk'
cask 'elgato-control-center'
cask 'font-fira-code'
cask 'google-chrome'
cask 'google-drive'
cask 'grammarly-desktop'
cask 'hey-desktop'
cask 'iterm2'
cask 'microsoft-azure-storage-explorer'
cask 'minecraft'
cask 'mongodb-compass'
cask 'ngrok'
#cask 'pycharm'
cask 'rectangle'
cask 'rider'
cask 'slack'
cask 'smoothscroll'
cask 'sonos'
cask 'spotify'
cask 'stats'
cask 'utm'
cask 'vlc'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'wispr-flow'
